[
  {
    "title": "Snow White and the Seven Dwarves",
    "author": "Grimm Brothers",
    "id": 3,
    "favorite": true,
    "text": "Once upon a time, a Queen was sitting at a window in her castle. She was sewing with the window open, to watch the flakes of winter snow. She pricked her finger with her needle and three drops of blood fell onto the windowsill. The blood was red, the snow was white, the windowsill was black.\n\n‘I wish I had a daughter with skin as white as snow, lips as red as blood, and hair as black as ebony,’ said the Queen.\n\nSometime later, the Queen gave birth to a little girl, who she named Snow White. But sadly, the Queen died giving birth and Snow White was left without a mother.\n\nThe King soon married again. His new wife was very beautiful, but she was also a witch. The new Queen also had a magic mirror. Every morning, she asked the mirror the same question: ‘Mirror, mirror, on the wall, who is the fairest of them all?’ Every morning, the mirror told the Queen that she was the fairest of them all. For years, the Queen was content, but one day, when Snow White was seven years old, the Mirror said that the princess was now fairer than the Queen.\n\nThe Queen couldn’t bear it. She was so jealous and angry that she ordered a huntsman to take Snow White into the woods and kill her. She told him to return with her heart as proof of her death.\n\nBut, when the Huntsman took Snow White into the forest, he found he couldn’t bear to kill her. As he raised the knife to kill her, Snow White begged for her life. She promised to run far away and never return to the castle again. Reluctantly, as he was very scared of the Queen, the Huntsman agreed and killed a wild animal instead, so he could present the Queen with its heart. \n\nSnow White walked through the forest for hours. Finally, she came to a small cottage. The door was unlocked, so she stepped inside. Everything in the cottage was small, and there were seven of everything. Snow White was very hungry, thirsty, and very tired. She ate some of the food, drank some of the wine and tucked herself up in one of the beds. She soon fell asleep.\n\nA few hours later, she woke to find seven small men around her. The men were dwarfs, returned from a day of work in the mines. Though initially alarmed at the idea that someone had broken into their home, the dwarfs soon took pity on the little girl, when she explained her stepmother’s plan to kill her. They agreed that she could stay with them if she took on the cooking and cleaning of the cottage. Snow White was delighted.\n\n‘One final rule,’ said the dwarfs. ‘You must be careful when alone at home. Don’t speak to any strangers, or let them in the house.’\n\nTen years passed. Snow White grew into a lovely, beautiful young woman, and she was getting on well with the dwarfs. The evil Queen, meanwhile, was still obsessed with the idea of her own beauty. She turned to her mirror again, and asked: ‘Mirror, mirror, on the wall, who is the fairest of them all?’\n\nThe mirror told her that Snow White was still the fairest of them all. The evil Queen was incensed. She thought she’d had Snow White killed ten years ago. She asked the mirror where Snow White was and, because the mirror was bound to always tell the truth, it showed her the cottage in the forest.\n\nHaving already been betrayed by the Huntsman, the Queen decided to kill Snow White herself. She set out to the cottage, disguised as an old peddler. She knocked on the door and, when Snow White answered, she showed her the beautifully laced bodices she was selling. She even offered to show Snow White how to lace them up. Snow White agreed but, as the Queen tied the laces, she pulled so tightly that Snow White couldn’t breathe and collapsed. Thinking Snow White was dead, the Queen left. But, luckily, the dwarfs returned and unlaced the bodice, just in time. Snow White took a huge gasp and was revived.\n\nPleased with herself, the evil Queen returned to the castle and turned to her mirror, asking: ‘Mirror, mirror, on the wall, who is the fairest of them all?’\n\n‘Snow White,’ said the mirror.\n\nAgain, the Queen raged. She returned to the cottage, this time dressed up as a tradeswoman. She knocked on the door and showed Snow White a beautiful jewelled comb. She showed Snow White how to wear it but, of course, the comb was laced with poison. When the Queen tucked it into Snow White’s hair, Snow White collapsed.\n\nOnce again, the Queen was convinced that she’d killed Snow White and fled back to the castle. But, when the dwarfs returned home, they removed the comb from Snow White’s locks, and she revived.\n\nThe Queen asked her mirror: ‘Mirror, mirror, on the wall, who is the fairest of them all?’\n\n‘Snow White,’ said the Mirror.\n\nThe Queen was livid. One final time, she made her way to the cottage. This time, she was dressed as a farmer’s wife. She knocked on the door and offered Snow White an apple. To make Snow White feel more comfortable about taking a bite, she cut the apple in half. The evil Queen took the green half and offered Snow White the red half.\n\n‘You see?’ said the Queen, taking a bite. ‘It’s fine.’\n\nSnow White took a bite and, of course, the red half was poisoned. She fell to the floor and, convinced that Snow White really was dead, the Queen fled back to the castle.\n\nThe dwarfs returned to the cottage and found Snow White lying on the floor. This time, nothing they did could revive her. Together, they placed her in a glass coffin outside and mourned her death.\n\nThe next day, a Prince was riding by. He came across the coffin and was struck by the beauty of the girl beyond the glass. He knocked on the door of the dwarfs’ cottage and asked for the story. The dwarfs told him all about Snow White and the witch, how they’d found Snow White lifeless on the floor for a third and final time. The Prince asked if he could take Snow White’s body back to her father’s castle, her rightful resting place. Reluctantly, the dwarfs agreed.\n\nThe Prince and his men transported the coffin through the forest. As they walked, one of his men tripped over a root and stumbled. He dropped his corner of the coffin and a piece of apple was dislodged from Snow White’s throat. Once it was free, she was magically revived.\n\nThe Prince opened the coffin and immediately asked for Snow White’s hand in marriage. She agreed and went with him to his kingdom. The Prince invited everyone in the land to their wedding, except the evil Queen.\n\nMeanwhile, the evil Queen was back at the castle. She consulted her mirror: ‘Mirror, mirror, on the wall, who is the fairest of them all?’\n\nThe mirror explained that a Prince of a nearby kingdom had a new bride. This new bride, the mirror said, was much fairer than the evil Queen.\n\nFurious, the evil Queen went to the wedding to investigate. When she saw the bride was Snow White, she was overcome with rage, fear and jealousy. Just as she was hatching yet another dastardly plan, the Prince spotted her. Remembering the stories the dwarfs and his new wife had told him, he ordered the guards to seize her. As punishment for her crimes, he ordered her to put on a pair of red-hot shoes and dance. The shoes burned her feet and she hopped from one foot to the other until she was dead."
  }
]